# 4.1 数据清洗

In [2]:

# 4.1.1 空值和缺失值处理

In [3]:
import numpy as np
np.nan  #nan缺失值

nan

In [4]:
type(np.nan)  #空值数据类型为float格式

float

In [5]:
from pandas import DataFrame, Series
import pandas as pd
from numpy import NaN
series_obj=Series([1,None,NaN]) # 创建包含空值和缺失值的数据
series_obj

0    1.0
1    NaN
2    NaN
dtype: float64

In [6]:
pd.isnull(series_obj)  #检查是否为空值

0    False
1     True
2     True
dtype: bool

In [7]:
ser_obj=Series([1.None,NaN]) 
pd.notnull(series_obj  #反向检查是否为空值)

SyntaxError: invalid syntax (<ipython-input-7-6a7411479d02>, line 1)

In [8]:
series_obj=Series([1.None,NaN]) 
pd.notnull(series_obj  #反向检查是否为空值)

SyntaxError: invalid syntax (<ipython-input-8-a3713f6118b7>, line 1)

In [9]:
series_obj=Series([1,None,NaN]) 
pd.notnull(series_obj  #反向检查是否为空值)

SyntaxError: unexpected EOF while parsing (<ipython-input-9-b47a230ec37b>, line 2)

In [10]:
series_obj=Series([1,None,NaN]) 
pd.notnull(series_obj )  #反向检查是否为空值

0     True
1    False
2    False
dtype: bool

In [11]:
import pandas as pd
import numpy as np
df_obj=pd.DataFrame({"类别":['小说', '散文随笔', '青春文学', '传记'],
                       "书名":[np.nan, '《皮囊》', '《旅程结束时》', '《老舍自传》'],
                       "作者":["老舍", None, "张其鑫", "老舍"]})  #导入二维数据表
df_obj

        书名    作者    类别
0      NaN    老舍    小说
1     《皮囊》  None  散文随笔
2  《旅程结束时》   张其鑫  青春文学
3   《老舍自传》    老舍    传记

In [12]:
df_obj.dropna(axis=1)   #dropna()方法的作用是删除含有空值或缺失值的行或列
# axis axis：确定过滤行或列。

     类别
0    小说
1  散文随笔
2  青春文学
3    传记

In [13]:
df_obj.dropna()  #删除数据集1中的空值和缺失值 (直接将含有非法值的行全部删除)

        书名   作者    类别
2  《旅程结束时》  张其鑫  青春文学
3   《老舍自传》   老舍    传记

In [14]:
df_obj = pd.DataFrame({'A': [1, 2, 3, NaN],
                       'B': [NaN, 4, NaN, 6],
                       'C': ['a', 7, 8, 9],
                       'D':[NaN, 2, 3, NaN]})
df_obj  # 导入二维表

     A    B  C    D
0  1.0  NaN  a  NaN
1  2.0  4.0  7  2.0
2  3.0  NaN  8  3.0
3  NaN  6.0  9  NaN

In [15]:
df_obj.fillna('66.0')  #使用‘66.0' 对异常值进行填充

      A     B  C     D
0     1  66.0  a  66.0
1     2     4  7     2
2     3  66.0  8     3
3  66.0     6  9  66.0

In [16]:
df_obj = pd.DataFrame({'A': [1, 2, 3, NaN],
                       'B': [NaN, 4, NaN, 6],
                       'C': ['a', 7, 8, 9],
                       'D': [NaN, 2, 3, NaN]})
df_obj #重新指定二维表

     A    B  C    D
0  1.0  NaN  a  NaN
1  2.0  4.0  7  2.0
2  3.0  NaN  8  3.0
3  NaN  6.0  9  NaN

In [17]:
df_obj.fillna({'A':4.0,'B':5.0})  #指定填充的列 并且指定每一列的填充数据

     A    B  C    D
0  1.0  5.0  a  NaN
1  2.0  4.0  7  2.0
2  3.0  5.0  8  3.0
3  4.0  6.0  9  NaN

In [18]:
df = pd.DataFrame({'A': [1, 2, 3, None],
                   'B': [NaN, 4, None, 6],
                   'C': ['a', 7, 8, 9],
                   'D': [None, 2, 3, NaN]})
df   #再次导入二维表

     A    B  C    D
0  1.0  NaN  a  NaN
1  2.0  4.0  7  2.0
2  3.0  NaN  8  3.0
3  NaN  6.0  9  NaN

In [19]:
df.fillna(method='ffill') # 使用前向填充的方式替换空值或缺失值
#  method:插值方式,默认为’ffill’,向前填充,或是向下填充 而‘bfill’:向后填充,或是向上填充 
# 前向填充:数据缺失部分参考前面的填充。

     A    B  C    D
0  1.0  NaN  a  NaN
1  2.0  4.0  7  2.0
2  3.0  4.0  8  3.0
3  3.0  6.0  9  3.0

In [21]:
person_info = pd.DataFrame({'id': [1, 2, 3, 4, 4, 5],
                            'name': ['小铭', '小月月', '彭岩', '刘华', '刘华', '周华'],
                            'age': [18, 18, 29, 58, 58, 36],
                            'height': [180, 180, 185, 175, 175, 178],
                            'gender': ['女', '女', '男', '男', '男', '男']})
person_info
person_info.duplicated()         # 从前向后查找和判断是否有重复值
# duplicated 处理重复值

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [22]:
person_info

   age gender  height  id name
0   18      女     180   1   小铭
1   18      女     180   2  小月月
2   29      男     185   3   彭岩
3   58      男     175   4   刘华
4   58      男     175   4   刘华
5   36      男     178   5   周华

In [23]:
person_info.drop_duplicates()   #显示删除重复的数据行后面的二维表，不破坏原有的表数据

   age gender  height  id name
0   18      女     180   1   小铭
1   18      女     180   2  小月月
2   29      男     185   3   彭岩
3   58      男     175   4   刘华
5   36      男     178   5   周华

In [24]:
person_info.drop_duplicates(inplace=True)   #删除重复的数据行，破坏原有的表数据
# inplace参数接收一个布尔类型的值，表示是否替换原来的数据，默认为False。

In [26]:
person_info  #查看表数据

   age gender  height  id name
0   18      女     180   1   小铭
1   18      女     180   2  小月月
2   29      男     185   3   彭岩
3   58      男     175   4   刘华
5   36      男     178   5   周华

4.1.1 异常值处理

In [27]:
# 导入需要使用的CSV数据
file = open('./第4章数据文件资源/example_data.csv')
data = pd.read_csv(file)
data

      A  B
0     1  2
1     2  3
2     3  8
3     4  5
4     5  6
5   560  7
6     2  8
7     3  9
8     3  0
9     4  3
10    5  4
11    3  5
12    2  6
13    4  7
14    5  2
15   23  4
16    2  5
17  342  6
18    3  4

In [32]:
#定义一个函数 three_sigma: 通过三西格玛（基于正态分布的数据情况）方式判断元素值是否异常
# 如果是异常值，则将异常值返回
#der 表示传入DataFrame的某一列
def three_sigma(ser):
    #求平均值
    mean_value=ser.mean()
    #求标准差
    std_value=ser.std()
    # 位于(μ-3σ,μ+3σ)区间的数据是正常的，不在这个区间的数据为异常的
    # ser中的数值小于μ-3σ或大于μ+3σ均为异常值
    # 一旦发现有异常值，就标注为True，否则标注为False
     #判断条件
    rule = (mean_value - 3 * std_value > ser) | (ser.mean() + 3 * ser.std() < ser)
    #需要根据条件完成数据的索引 返回异常值的位置索引
    index=np.arange(ser.shape[0])[rule] #获取行索引
    # 获取异常数据
    outrange=ser.iloc[index]
    return outrange

In [33]:
# 调用函数
three_sigma(data['A'])
#或者写为 data.A

5    560
Name: A, dtype: int64

In [34]:
three_sigma(data['B'])

Series([], Name: B, dtype: int64)

In [35]:
df = pd.DataFrame({'A': [1, 2, 3, 4],
                   'B': [2, 3, 5, 2],
                   'C': [1, 4, 7, 4],
                   'D': [1, 5, 30, 3]})
df

   A  B  C   D
0  1  2  1   1
1  2  3  4   5
2  3  5  7  30
3  4  2  4   3

In [36]:
df.boxplot(column=['A', 'B', 'C', 'D'])  #生成箱形图
# boxplot()方法，专门用来绘制箱形图。
# column，默认为None，输入为str 或由str构成的list,其作用是指定要进行箱型图分析的列

In [37]:
df.boxplot(column=['A', 'B', 'C', 'D'])  #生成箱形图

In [38]:
df = pd.DataFrame ({'菜谱名': ['红烧肉', '铁板鱿鱼', 
                    '小炒肉', '干锅鸭掌', '酸菜鱼'],
                    '价格': [38, 25, 26, 388, 35]})
df

    价格   菜谱名
0   38   红烧肉
1   25  铁板鱿鱼
2   26   小炒肉
3  388  干锅鸭掌
4   35   酸菜鱼

In [40]:
df.replace(to_replace=388,value=38.8)
# to_replace：表示查找被替换值的方式。
# value：用来替换任何匹配to_replace的值，默认值None。

     价格   菜谱名
0  38.0   红烧肉
1  25.0  铁板鱿鱼
2  26.0   小炒肉
3  38.8  干锅鸭掌
4  35.0   酸菜鱼

4.1.4 更改数据类型

In [41]:
import pandas as pd
df = pd.DataFrame({'A':['5', '6', '7'], 'B':['3', '2', '1']})
df

   A  B
0  5  3
1  6  2
2  7  1

In [42]:
df.dtypes  # 查看数据的类型

A    object
B    object
dtype: object

In [43]:
# 创建DataFrame对象，数据的类型为int
df = pd.DataFrame({'A': ['5', '6', '7'], 'B': ['3', '2', '1']},dtype=int)
df

   A  B
0  5  3
1  6  2
2  7  1

In [44]:
df.dtypes

A    int32
B    int32
dtype: object

In [45]:
df = pd.DataFrame({'A': ['5', '6', '7'], 'B': ['3', '2', '1']})
df.astype(int)

   A  B
0  5  3
1  6  2
2  7  1

In [46]:
df.dtypes   # 查看数据的类型,可见直接在df上操作astype并不会把df中数据类型改成int

A    object
B    object
dtype: object

In [47]:
df2=df.astype(int) # 使用另外一个表进行接收 这样使用这个函数 不对原来的表进行更改
df2.dtypes   # 查看数据的类型 需要使用新的表 才能指定数据类型

A    int32
B    int32
dtype: object

In [48]:
df = pd.DataFrame({'A': ['1', '1.2', '4.2'],
                   'B': ['-9', '70', '88'],
                   'C': ['x', '5.0', '0']})
df

     A   B    C
0    1  -9    x
1  1.2  70  5.0
2  4.2  88    0

In [49]:
df['B'].astype(dtype='int')  # 强制转换为int类型  或者：df.B.astype(dtype='int')  也可以

0    -9
1    70
2    88
Name: B, dtype: int32

In [50]:
ser_obj = pd.Series(['1', '1.2', '4.2'])
ser_obj

0      1
1    1.2
2    4.2
dtype: object

In [52]:
# 转换object类型为float类型
pd.to_numeric(ser_obj, errors='raise')  
# to_numeric()函数可以将传入的参数转换为数值类型。
# arg：表示要转换的数据，可以是list、tuple、Series。
# errors：表示错误采取的处理方式。
# raise:允许引发异常 ignore:禁止显示异常。

0    1.0
1    1.2
2    4.2
dtype: float64

4.2 数据合并

4.2.1 轴向堆叠数据

In [53]:
import pandas as pd
df1 = pd.DataFrame({'A': ['A0', 'A0', 'A1'],
                    'B': ['B0', 'B0', 'B1']})
df2 = pd.DataFrame({'C': ['C0', 'C0', 'C1', 'C3'],
                    'D': ['D0', 'D2', 'D2', 'D3']})

In [54]:
df1

    A   B
0  A0  B0
1  A0  B0
2  A1  B1

In [55]:
df2

    C   D
0  C0  D0
1  C0  D2
2  C1  D2
3  C3  D3

In [59]:
# 横向堆叠合并df1和df2 采用外连接的方式
pd.concat([df1,df2],join='outer',axis=1)
# axis：表示连接的轴向，可以为0或1，默认为0。
# join：表示连接的方式，inner表示内连接，outer表示外连接，默认使用外连接。
# ignore_index：如果设置为True，清除现有索引并重置索引值。
# names：结果分层索引中的层级的名称。

# 当使用concat()函数合并时，若是将axis参数的值设为1，且join参数的值设为outer，
# 代表着使用横向堆叠与外连接的方式进行合并。

# 外连接分为三种，分别是是左外连接(LEFT OUTER J0IN 或 LEFT JOIN 右外连
# 接(RIGHT OUTER JOIN 或 RIC GHT JOIN、全外连接(FULL OUTER JOIN
# 或 FULLJOIN)。
# 左外连接:又称为左连接，这种连接方式会显示左表不符合条件的数据行，右边
# 不符合条件的数据行直接显示 NULL。
# 右外连接:也被称为右连接，他与左连接相对，这种连接方式会显示右表不符合
# 条件的数据行，左表不符合条件的数据行直接显示 NULL。

     A    B   C   D
0   A0   B0  C0  D0
1   A0   B0  C0  D2
2   A1   B1  C1  D2
3  NaN  NaN  C3  D3

In [60]:
first = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2'],
                      'C': ['C0', 'C1', 'C2']})
second = pd.DataFrame({'B': ['B3', 'B4', 'B5'],
                       'C': ['C3', 'C4', 'C5'],
                       'D': ['D3', 'D4', 'D5']})

In [62]:
first

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [63]:
second

    B   C   D
0  B3  C3  D3
1  B4  C4  D4
2  B5  C5  D5

In [64]:
pd.concat([first, second], join='inner', axis=0)     # axis=0 纵向轴

    B   C
0  B0  C0
1  B1  C1
2  B2  C2
0  B3  C3
1  B4  C4
2  B5  C5

In [65]:
pd.concat([first, second], join='inner', axis=1)  # axis=1 横向轴

    A   B   C   B   C   D
0  A0  B0  C0  B3  C3  D3
1  A1  B1  C1  B4  C4  D4
2  A2  B2  C2  B5  C5  D5

In [66]:
# 横向堆叠合并df1和df2，采用内连接的方式
pd.concat([df1, df2], join='inner', axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A0  B0  C0  D2
2  A1  B1  C1  D2

In [67]:
# 纵向堆叠合并df1和df2，采用外连接的方式
pd.concat([df1, df2], join='outer', axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A0   B0  NaN  NaN
2   A1   B1  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C0   D2
2  NaN  NaN   C1   D2
3  NaN  NaN   C3   D3

In [68]:
# 纵向堆叠合并df1和df2，采用内连接的方式
pd.concat([df1, df2], join='inner', axis=0)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 0, 1, 2, 3]

4.2.2 主键合并数据

In [69]:
import pandas as pd
left = pd.DataFrame({'key':['K0','K1','K2'],
                       'A':['A0','A1','A2'],
                        'B':['B0','B1','B2']})
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                         'C':['C0','C1','C2','C3'],
                         'D':['D0','D1','D2','D3']})

In [70]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2

In [71]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [72]:
# 用于主键合并的merge()函数。
pd.merge(left=left,right=right,on='key',how='inner') 
# on='key' 指定key列当成连接键

# left：参与合并的左侧DataFrame对象。
#  right：参与合并的右侧DataFrame对象。
#   how：表示连接方式，默认为inner。

# how参数可以取下列值：
# left：使用左侧的DataFrame的键，类似SQL的左外连接。
# right：使用右侧的DataFrame的键，类似SQL的右外连接。
# outer：使用两个DataFrame所有的键，类似SQL的全连接。
# inner：使用两个DataFrame键的交集，类似SQL的内连接

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

In [73]:
pd.merge(left, right, on='key')   #写成这种方式也可以

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

In [74]:
left = pd.DataFrame({'key':['K0','K1','K2'],
                       'A':['A0','A1','A2'],
                       'B':['B0','B1','B2']})
right = pd.DataFrame({'key':['K0','K5','K2','K4'],
                         'B':['B0','B1','B2','B5'],
                         'C':['C0','C1','C2','C3'],
                         'D':['D0','D1','D2','D3']})

In [75]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2

In [76]:
right

    B   C   D key
0  B0  C0  D0  K0
1  B1  C1  D1  K5
2  B2  C2  D2  K2
3  B5  C3  D3  K4

In [77]:
pd.merge(left,right,on=['key','B'])  #内连接的条件：['key', 'B']  两个表中要同时要有 key 和 ‘B’的值 才能生成合并后的新表

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A2  B2  K2  C2  D2

In [78]:
left = pd.DataFrame({'A':['A0','A1','A2'],
                       'B':['B0','B1','B2']})
right = pd.DataFrame({'C':['C0','C1','C2'],
                         'D':['D0','D1','D2']})

In [79]:
left

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [80]:
right

    C   D
0  C0  D0
1  C1  D1
2  C2  D2

In [81]:
pd.merge(left,right,how='outer',left_index=True,right_index=True)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

4.2.3 根据索引合并数据

In [82]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2']})
right = pd.DataFrame({'C': ['C0', 'C1', 'C2'],
                         'D': ['D0', 'D1', 'D2']},
                        index=[ 'a','b','c'])

In [83]:
left

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [84]:
right

    C   D
a  C0  D0
b  C1  D1
c  C2  D2

In [85]:
right.join(left, how='outer')

     C    D    A    B
a   C0   D0  NaN  NaN
b   C1   D1  NaN  NaN
c   C2   D2  NaN  NaN
0  NaN  NaN   A0   B0
1  NaN  NaN   A1   B1
2  NaN  NaN   A2   B2

In [86]:
left.join(right, how='outer')

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
a  NaN  NaN   C0   D0
b  NaN  NaN   C1   D1
c  NaN  NaN   C2   D2

In [87]:
# 使用外连接的方式将left与right进行合并时，列中相同的数据会重叠，没有数据的位置使用NaN进行填充

In [88]:
# 左连接是以左表为基准进行连接，所以left表中的数据会全部显示，
# right表中只会显示与重叠数据行索引值相同的数据，合并后表中缺失的数据会使用NaN进行填充。

In [89]:
# 假设两张表中的行索引与列索引均没有重叠的部分，但依旧可以使用merge函数来合并，
# 只需要将参数left_index与right_index的值设置为True即可。

In [91]:
# join()方法能够通过索引或指定列来连接多个DataFrame对象。

In [92]:
# on：名称，用于连接列名。
# how：可以从{''left'' ,''right'', ''outer'', ''inner''}中任选一个，默认使用左连接的方式。
# sort：根据连接键对合并的数据进行排序，默认为False。

In [93]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2'],
                      'key': ['K0', 'K1', 'K2']})
right = pd.DataFrame({'C': ['C0', 'C1','C2'],
                         'D': ['D0', 'D1','D2']},
                        index=['K0', 'K1','K2'])

In [96]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2

In [95]:
right

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2

In [97]:
# on参数指定连接的列名
left.join(right, how='left', on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

4.2.4 合并重叠数据

In [98]:
import pandas as pd
import numpy as np
from numpy import NAN
left = pd.DataFrame({'A': [np.nan, 'A1', 'A2', 'A3'],
                        'B': [np.nan, 'B1', np.nan, 'B3'],
                        'key': ['K0', 'K1', 'K2', 'K3']})
right = pd.DataFrame({'A': ['C0', 'C1','C2'],
                         'B': ['D0', 'D1','D2']},
                         index=[1,0,2])

In [99]:
left

     A    B key
0  NaN  NaN  K0
1   A1   B1  K1
2   A2  NaN  K2
3   A3   B3  K3

In [100]:
right

    A   B
1  C0  D0
0  C1  D1
2  C2  D2

In [101]:
# 用right的数据填充left缺失的部分
left.combine_first(right)

    A   B key
0  C1  D1  K0
1  A1  B1  K1
2  A2  D2  K2
3  A3  B3  K3

4.3 数据重塑

In [102]:
df = pd.DataFrame({'A':['A0','A1','A2'],
                 'B':['B0','B1','B2']})

In [104]:
df

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [105]:
df.stack()
# Pandas中重塑层次化索引的操作主要是stack()方法和unstack()方法，
# 前者是将数据的列“旋转”为行，后者是将数据的行“旋转”为列。

0  A    A0
   B    B0
1  A    A1
   B    B1
2  A    A2
   B    B2
dtype: object

In [106]:
# level：表示操作内层索引。若设为0，表示操作外层索引，默认为-1。
# dropna：表示是否将旋转后的缺失值删除，若设为True，则表示自动过滤缺失值，设置为False则相反。

In [107]:
ret=df.stack()

In [108]:
ret

0  A    A0
   B    B0
1  A    A1
   B    B1
2  A    A2
   B    B2
dtype: object

In [109]:
type(ret)

pandas.core.series.Series

In [110]:
ret.unstack()  #旋转回来

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [111]:
df = pd.DataFrame(np.array([[26,20,22,26],[30,25,24,20]]),
                   index=['男生人数','女生人数'],
                   columns=[['一楼','一楼','二楼','二楼'],
                              ['A教室','B教室','A教室','B教室']])
df

      一楼      二楼
     A教室 B教室 A教室 B教室
男生人数  26  20  22  26
女生人数  30  25  24  20

In [112]:
df.stack()

          一楼  二楼
男生人数 A教室  26  22
     B教室  20  26
女生人数 A教室  30  24
     B教室  25  20

In [113]:
df.stack(level=0)   # 旋转外层索引

         A教室  B教室
男生人数 一楼   26   20
     二楼   22   26
女生人数 一楼   30   25
     二楼   24   20

4.3.2 轴向旋转

In [114]:
df =  pd.DataFrame({'商品名称': ['荣耀9青春版','小米6x','OPPO A1',
                   '荣耀9青春版','小米6x','OPPO A1'],
                   '出售日期': ['2017年5月25日', '2017年5月25日',
                   '2017年5月25日','2017年6月18日',
                   '2017年6月18日', '2017年6月18日'],
                   '价格': ['999元', '1399元', '1399元',
                   '800元', '1200元', '1250元']})
df

      价格        出售日期     商品名称
0   999元  2017年5月25日   荣耀9青春版
1  1399元  2017年5月25日     小米6x
2  1399元  2017年5月25日  OPPO A1
3   800元  2017年6月18日   荣耀9青春版
4  1200元  2017年6月18日     小米6x
5  1250元  2017年6月18日  OPPO A1

In [115]:
df.pivot(index='出售日期', columns='商品名称', values='价格')     #index 行索引      column 列索引     values  填充值

商品名称       OPPO A1   小米6x 荣耀9青春版
出售日期
2017年5月25日   1399元  1399元   999元
2017年6月18日   1250元  1200元   800元

4.4 转换数据

4.4.1 重命名轴索引

In [116]:
df = pd.DataFrame({'A':['A0', 'A1', 'A2', 'A3'],
                 'B':['B0', 'B1', 'B2', 'B3'],
                 'C':['C0', 'C1', 'C2', 'C3']})
df

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [117]:
# 重命名列索引的名称，并且在原有数据上进行修改
df.rename(columns={'A':'aa', 'B':'bb', 'C':'cc'}, inplace=True)     #inplace=True,表示 在原有的基础上替换
df

   aa  bb  cc
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [120]:
# index，columns：表示对行索引名或列索引名的转换。
# inplace：默认为False，表示是否返回新的Pandas对象。

In [136]:
# import matplotlib.pyplot as plt
df.rename(str.upper,axis='columns')

TypeError: rename() got an unexpected keyword argument "axis"

In [122]:
df.rename(index={1: 'a', 2: 'b',3:'c'}, inplace=True)

In [123]:
df

   aa  bb  cc
0  A0  B0  C0
a  A1  B1  C1
b  A2  B2  C2
c  A3  B3  C3

4.4.2 离散化连续数据

In [124]:
# 使用pandas的cut函数划分年龄组
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 32]
bins = [0, 18, 25, 35, 60, 100]
cuts = pd.cut(ages, bins)
cuts

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (35, 60], (25, 35], (60, 100], (35, 60], (25, 35]]
Length: 11
Categories (5, interval[int64]): [(0, 18] < (18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [125]:
pd.cut(ages, bins=bins, right=False)   #更改右边区间闭合

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [35, 60), [25, 35), [60, 100), [35, 60), [25, 35)]
Length: 11
Categories (5, interval[int64]): [[0, 18) < [18, 25) < [25, 35) < [35, 60) < [60, 100)]

4.4.3 哑变量处理类别型数据

In [126]:
#将年龄数据处理成类别型数据
ret=pd.cut(ages,bins,labels=['少年','青年','中年','中老年','老年'])
ret
#将处理的类别型数据转换为哑变量矩阵
# x：表示要分箱的数组，必须是一维的。
# bins：接收int和序列类型的数据。
# right：是否包含右端点，决定区间的开闭，默认为True。

[青年, 青年, 青年, 中年, 青年, ..., 中老年, 中年, 老年, 中老年, 中年]
Length: 11
Categories (5, object): [少年 < 青年 < 中年 < 中老年 < 老年]

In [127]:
pd.get_dummies(ret, prefix='年龄类别:')  # 哑变量处理
# data：表示哑变量处理的数据。
# prefix：表示列名的前缀，默认为None。
# prefix_sep：用于附加前缀作为分隔符使用，默认为“_”

    年龄类别:_少年  年龄类别:_青年  年龄类别:_中年  年龄类别:_中老年  年龄类别:_老年
0          0         1         0          0         0
1          0         1         0          0         0
2          0         1         0          0         0
3          0         0         1          0         0
4          0         1         0          0         0
5          0         1         0          0         0
6          0         0         0          1         0
7          0         0         1          0         0
8          0         0         0          0         1
9          0         0         0          1         0
10         0         0         1          0         0

In [128]:
df1 = pd.DataFrame({'职业': ['工人', '学生', '司机', '教师', '导游']})
df1

   职业
0  工人
1  学生
2  司机
3  教师
4  导游

In [129]:
pd.get_dummies(df1, prefix=['col'])  # 哑变量处理 加前缀

   col_司机  col_学生  col_导游  col_工人  col_教师
0       0       0       0       1       0
1       0       1       0       0       0
2       1       0       0       0       0
3       0       0       0       0       1
4       0       0       1       0       0